netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/esb_search_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.netsuite">
  <soapenv:Header></soapenv:Header>
  <soapenv:Body>
  <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
  <urn:method>search</urn:method>
    <urn:bodyFieldsOnly></urn:bodyFieldsOnly>
    <urn:returnSearchColumns></urn:returnSearchColumns>
    <urn:pageSize></urn:pageSize>
    <urn:partnerId></urn:partnerId>
    <urn:applicationId></urn:applicationId>
    <urn:email>%s(email)</urn:email>
    <urn:password>%s(password)</urn:password>
    <urn:account>%s(account)</urn:account>
    <urn:roleInternalId></urn:roleInternalId>
    <urn:roleExternalId></urn:roleExternalId>
    <urn:roleType></urn:roleType>
    <urn:roleName></urn:roleName>
    <urn:searchRecord>
		<platformMsgs:searchRecord  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xsi:type="ns1:EmployeeSearch" xmlns:ns1="urn:employees_2014_1.lists.webservices.netsuite.com" xmlns:platformMsgs="urn:messages_2014_1.platform.webservices.netsuite.com" xmlns:platformCore="urn:core_2014_1.platform.webservices.netsuite.com">
		        <basic>
		        <email operator="contains" xsi:type="platformCore:SearchStringField1">
		        <searchValue>.com</searchValue>
		        </email>
		        </basic>
		</platformMsgs:searchRecord>
    </urn:searchRecord>
  </soapenv:Body>
</soapenv:Envelope>